const bookVersionList = [
  {
    "version": "1.7.0.1",
    "title": "",
    "description": [
      "【新增】社團特訓第10期資訊",
      "【修正】社團特訓莫布、孤傲劍客技能敘述錯誤",
    ]
  },
  {
    "version": "1.7.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：千術之王、黑桃A",
      "【修正】角色基礎數值：囚鳥綺願",
    ]
  },
  {
    "version": "1.6.3.0",
    "title": "",
    "description": [
      "【新增】社團特訓第9期實際數值",
    ]
  },
  {
    "version": "1.6.2.0",
    "title": "",
    "description": [
      "【新增】社團特訓第1期、第5期與第9期資訊",
      "【修正】無立繪的角色應顯示問號圖示",
      "【修正】社團特訓第7期防禦力數值微幅修正",
    ]
  },
  {
    "version": "1.6.1.0",
    "title": "",
    "description": [
      "【新增】角色圖片：幽皇月韻、山明箬影、靈棰驚竹、茂林餘音",
      "【新增】社團特訓第8期實際數值",
      "【新增】1.6版本橫幅",
      "【修正】技能敘述錯誤：多洛茜‧囚鳥綺願、艾琳娜‧致命音符",
    ]
  },
  {
    "version": "1.6.0.1",
    "title": "",
    "description": [
      "【新增】社團特訓第4期與第8期資訊",
      "【修正】社團特訓第7期資訊",
    ]
  },
  {
    "version": "1.6.0.0",
    "title": "",
    "description": [
      "【新增】社團特訓分頁與社團特訓計算機(計算機僅電腦版可用)",
      "【新增】新角色技能與數據：幽皇月韻、山明箬影、靈棰驚竹、茂林餘音",
      "【修正】部分手機版裝置無法順利開啟側邊攔",
      "【修正】技能描述修正：醉紅塵",
    ]
  },
  {
    "version": "1.6.0-pre",
    "title": "",
    "description": [
      "【新增】社團特訓分頁與社團特訓計算機(計算機僅電腦版可用)",
      "【新增】角色欄位：幽皇月韵",
      "【修正】部分手機版裝置無法順利開啟側邊攔",
      "【修正】技能描述修正：醉紅塵",
    ]
  },
  {
    "version": "1.5.3.0",
    "title": "",
    "description": [
      "【新增】版本資訊頁面",
      "【新增】角色圖片：指尖芳菲、離夢蝶",
      "【新增】版本更新提示(就是這裡)",
      "【優化】角色圖片載入更加流暢了",
    ]
  },
  {
    "version": "1.5.2.1",
    "title": "",
    "description": [
      "【修正】重新整理後會找不到頁面的問題",
      "【修正】貓球技能說明提示框失效",
    ]
  },
  {
    "version": "1.5.2.0",
    "title": "",
    "description": [
      "【新增】貓球分頁",
      "【新增】角色圖片：花間意",
      "【新增】角色技能與數據：離夢蝶、指尖芳菲",
      "【修正】清平樂技能敘述",
    ]
  },
  {
    "version": "1.5.1.0",
    "title": "",
    "description": [
      "【新增】角色圖片：清平樂、醉紅塵",
      "【新增】角色名稱：指尖芳菲",
      "【優化】版本歷史細節列表",
      "【修正】有機會在兩個升星效果之間點擊跳轉應不存在的星數",
    ]
  },
  {
    "version": "1.5.0.0",
    "title": "",
    "description": [
      "【新增】角色技能與基本數據：清平樂、醉紅塵、花間意",
    ]
  },
  {
    "version": "1.4.2.0",
    "title": "",
    "description": [
      "【新增】角色圖片：心動季節",
      "【優化】篩選機制-預設為全部不選，與全選的意思一樣",
      "【修正】滌蕩者、詭夜霧行角色數值與技能描述",
      "【修正】部分手機版跑板問題",
    ]
  },
  {
    "version": "1.4.1.0",
    "title": "",
    "description": [
      "【新增】角色圖片：月朧吟、並蒂蓮、菡萏曲",
      "【新增】版本歷史功能",
      "【新增】角色基礎數值欄位",
      "【優化】屬性/粒子/稀有度 使用與遊戲相同icon",
      "【優化】其他版面優化",
      "【修正】卡片稀有度圖示跑版問題",
      "【修正】手機版無法紀錄星數的問題",
    ]
  },
  {
    "version": "1.4.0.0",
    "title": "",
    "description": [
      "【新增】角色技能：月朧吟、並蒂蓮、菡萏曲",
    ]
  },
  {
    "version": "1.4.0-pre",
    "title": "",
    "description": [
      "【新增】貓之城1.4版本前的角色技能",
    ]
  },
  {
    "version": "",
    "title": "Before 1.4.0",
    "description": [
      "【其他】在此之前未受版本紀錄",
    ]
  },
]

const catCityVersionList = [
  {
    "version": "1.7",
    "title": "深淵的迴響"
  },
  {
    "version": "1.6",
    "title": "竹野熊蹤"
  },
  {
    "version": "1.5",
    "title": "夢境奇緣"
  },
  {
    "version": "1.4",
    "title": "龍貓相遇，雲瑞成雙"
  },
  {
    "version": "1.3",
    "title": "無法逃離的世界"
  },
  {
    "version": "1.2",
    "title": "消融冰雪之心"
  },
  {
    "version": "1.1",
    "title": "暖雪來信"
  },
]

export default {
  bookVersionList,
  catCityVersionList
}
