const bookVersionList = [
  {
    "version": "1.17.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：絢爛之雨",
      "【新增】角色圖片：絢爛之雨",
    ]
  },
  {
    "version": "1.16.2.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：幸福時光、糖果甜心",
      "【新增】角色圖片：幸福時光、糖果甜心",
    ]
  },
  {
    "version": "1.16.1.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：金雀台",
      "【新增】角色圖片：金雀台",
    ]
  },
  {
    "version": "1.16.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：破陣曲、雲天外、守月歌、雙生俠影",
      "【新增】角色圖片：破陣曲、雲天外、守月歌、雙生俠影",
      "【修正】滌蕩者技能敘述"
    ]
  },
  {
    "version": "1.14.1.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：森嶼漁歌",
      "【新增】角色圖片：森嶼漁歌",
      "【新增】社團特訓第24期數據&實際數值",
    ]
  },
  {
    "version": "1.14.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：惡兆之影",
      "【新增】角色圖片：惡兆之影",
      "【新增】1.14版本橫幅",
    ]
  },
  {
    "version": "1.13.1.0",
    "title": "",
    "description": [
      "【新增】社團特訓第23期數據&實際數值",
    ]
  },
  {
    "version": "1.13.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：天使心、爆破藝術、多情演繹、衍罪之淵",
      "【新增】角色圖片：天使心、爆破藝術、多情演繹、衍罪之淵",
      "【新增】1.11~1.13版本橫幅",
      "【新增】社團特訓第22期數據&實際數值"
    ]
  },
  {
    "version": "1.12.3.0",
    "title": "",
    "description": [
      "【新增】社團特訓第21期數據&實際數值",
    ]
  },
  {
    "version": "1.12.2.0",
    "title": "",
    "description": [
      "【新增】角色圖片：星月夜、繪空事",
    ]
  },
  {
    "version": "1.12.1.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：風物詩、星月夜、繪空事",
      "【新增】角色圖片：風物詩",
    ]
  },
  {
    "version": "1.12.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：浪花約會",
      "【新增】角色圖片：浪花約會",
    ]
  },
  {
    "version": "1.11.2.0",
    "title": "",
    "description": [
      "【新增】角色圖片：愈者療心",
      "【新增】社團特訓第20期數據&實際數值",
    ]
  },
  {
    "version": "1.11.1.0",
    "title": "",
    "description": [
      "【新增】社團特訓第19期數據&實際數值",
    ]
  },
  {
    "version": "1.11.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：愈者療心、十二夜中人、理性邊界、掌上淑女",
      "【新增】角色圖片：十二夜中人、理性邊界、掌上淑女",
      "【優化】角色圖片亮度"
    ]
  },
  {
    "version": "1.10.2.0",
    "title": "",
    "description": [
      "【新增】社團特訓第18期數據&實際數值",
      "【修正】強化技能顯示錯誤"
    ]
  },
  {
    "version": "1.10.1.0",
    "title": "",
    "description": [
      "【新增】角色圖片：鯨語海鳴、企鵝冰山、激潮之夏、破浪逐潮",
      "【新增】社團特訓第17期數據&實際數值",
      "【修正】技能敘述錯誤：鯨語海鳴、企鵝冰山、破浪逐潮"
    ]
  },
  {
    "version": "1.10.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：鯨語海鳴、企鵝冰山、激潮之夏、破浪逐潮",
      "【新增】社團特訓第16期數據&實際數值",

    ]
  },
  {
    "version": "1.9.2.0",
    "title": "",
    "description": [
      "【新增】社團特訓第15期數據&實際數值",
      "【修正】角色技能暗改：離夢蝶、清平樂"
    ]
  },
  {
    "version": "1.9.1.0",
    "title": "",
    "description": [
      "【新增】社團特訓第14期實際數值",
    ]
  },
  {
    "version": "1.9.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：場外焦點",
      "【新增】角色圖片：場外焦點",
      "【新增】社團特訓第14期資訊",
      "【修正】角色基礎數值：冬季奇遇、白瑰綺晶、致聖雪夜"
    ]
  },
  {
    "version": "1.8.3.0",
    "title": "",
    "description": [
      "【修正】社團特訓莫布、爆裂鼓蟹、孤傲劍客、寶寶玩偶技能敘述錯誤",
      "【修正】社團特訓預設期數不存在的錯誤導致頁面空白"
    ]
  },
  {
    "version": "1.8.2.0",
    "title": "",
    "description": [
      "【新增】角色圖片：架刑罪贖",
      "【新增】社團特訓第13期資訊&實際數值",
      "【修正】技能敘述錯誤：祈-離夢蝶",
    ]
  },
  {
    "version": "1.8.1.0",
    "title": "",
    "description": [
      "【新增】社團特訓第12期實際數值",
      "【新增】1.8版本橫幅"
    ]
  },
  {
    "version": "1.8.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：旋風初成、懵懂精靈、喵星電波、香甜滿溢、架刑罪贖",
      "【新增】角色圖片：旋風初成、懵懂精靈、喵星電波、香甜滿溢",
      "【新增】社團特訓第12期資訊",
      "【修正】技能敘述錯誤：小音-耀夜之星",
    ]
  },
  {
    "version": "1.7.4.0",
    "title": "",
    "description": [
      "【新增】社團特訓第11期實際數值",
      "【新增】角色圖片：鈴鈴彌音",
    ]
  },
  {
    "version": "1.7.3.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：鈴鈴彌音",
      "【新增】社團特訓第11期資訊",
      "【優化】對角色升星效果的特殊效果添加提示框",
    ]
  },
  {
    "version": "1.7.2.0",
    "title": "",
    "description": [
      "【新增】社團特訓第10期實際數值",
      "【修正】社團特訓竹牙巨人技能敘述錯誤",
    ]
  },
  {
    "version": "1.7.1.0",
    "title": "",
    "description": [
      "【新增】角色圖片：千術之王、黑桃A",
      "【新增】經營類貓球關於戰鬥心得的技能敘述",
      "【修正】技能敘述錯誤：雲沛‧並蒂蓮、特莉絲‧幽篁月韻",
      "【優化】社團特訓頁面會回到最後一次瀏覽的期數&輪次，輪次紀錄每期獨立儲存",
    ]
  },
  {
    "version": "1.7.0.1",
    "title": "",
    "description": [
      "【新增】社團特訓第10期資訊",
      "【修正】社團特訓莫布、孤傲劍客技能敘述錯誤",
    ]
  },
  {
    "version": "1.7.0.0",
    "title": "",
    "description": [
      "【新增】新角色技能與數據：千術之王、黑桃A",
      "【新增】1.7版本橫幅",
      "【修正】角色基礎數值：囚鳥綺願",
    ]
  },
  {
    "version": "1.6.3.0",
    "title": "",
    "description": [
      "【新增】社團特訓第9期實際數值",
    ]
  },
  {
    "version": "1.6.2.0",
    "title": "",
    "description": [
      "【新增】社團特訓第1期、第5期與第9期資訊",
      "【修正】無立繪的角色應顯示問號圖示",
      "【修正】社團特訓第7期防禦力數值微幅修正",
    ]
  },
  {
    "version": "1.6.1.0",
    "title": "",
    "description": [
      "【新增】角色圖片：幽篁月韻、山明箬影、靈棰驚竹、茂林餘音",
      "【新增】社團特訓第8期實際數值",
      "【新增】1.6版本橫幅",
      "【修正】技能敘述錯誤：多洛茜‧囚鳥綺願、艾琳娜‧致命音符",
    ]
  },
  {
    "version": "1.6.0.1",
    "title": "",
    "description": [
      "【新增】社團特訓第4期與第8期資訊",
      "【修正】社團特訓第7期資訊",
    ]
  },
  {
    "version": "1.6.0.0",
    "title": "",
    "description": [
      "【新增】社團特訓分頁與社團特訓計算機(計算機僅電腦版可用)",
      "【新增】新角色技能與數據：幽篁月韻、山明箬影、靈棰驚竹、茂林餘音",
      "【修正】部分手機版裝置無法順利開啟側邊攔",
      "【修正】技能描述修正：醉紅塵",
    ]
  },
  {
    "version": "1.6.0-pre",
    "title": "",
    "description": [
      "【新增】社團特訓分頁與社團特訓計算機(計算機僅電腦版可用)",
      "【新增】角色欄位：幽皇月韵",
      "【修正】部分手機版裝置無法順利開啟側邊攔",
      "【修正】技能描述修正：醉紅塵",
    ]
  },
  {
    "version": "1.5.3.0",
    "title": "",
    "description": [
      "【新增】版本資訊頁面",
      "【新增】角色圖片：指尖芳菲、離夢蝶",
      "【新增】版本更新提示(就是這裡)",
      "【優化】角色圖片載入更加流暢了",
    ]
  },
  {
    "version": "1.5.2.1",
    "title": "",
    "description": [
      "【修正】重新整理後會找不到頁面的問題",
      "【修正】貓球技能說明提示框失效",
    ]
  },
  {
    "version": "1.5.2.0",
    "title": "",
    "description": [
      "【新增】貓球分頁",
      "【新增】角色圖片：花間意",
      "【新增】角色技能與數據：離夢蝶、指尖芳菲",
      "【修正】清平樂技能敘述",
    ]
  },
  {
    "version": "1.5.1.0",
    "title": "",
    "description": [
      "【新增】角色圖片：清平樂、醉紅塵",
      "【新增】角色名稱：指尖芳菲",
      "【優化】版本歷史細節列表",
      "【修正】有機會在兩個升星效果之間點擊跳轉應不存在的星數",
    ]
  },
  {
    "version": "1.5.0.0",
    "title": "",
    "description": [
      "【新增】角色技能與基本數據：清平樂、醉紅塵、花間意",
    ]
  },
  {
    "version": "1.4.2.0",
    "title": "",
    "description": [
      "【新增】角色圖片：心動季節",
      "【優化】篩選機制-預設為全部不選，與全選的意思一樣",
      "【修正】滌蕩者、詭夜霧行角色數值與技能描述",
      "【修正】部分手機版跑板問題",
    ]
  },
  {
    "version": "1.4.1.0",
    "title": "",
    "description": [
      "【新增】角色圖片：月朧吟、並蒂蓮、菡萏曲",
      "【新增】版本歷史功能",
      "【新增】角色基礎數值欄位",
      "【優化】屬性/粒子/稀有度 使用與遊戲相同icon",
      "【優化】其他版面優化",
      "【修正】卡片稀有度圖示跑版問題",
      "【修正】手機版無法紀錄星數的問題",
    ]
  },
  {
    "version": "1.4.0.0",
    "title": "",
    "description": [
      "【新增】角色技能：月朧吟、並蒂蓮、菡萏曲",
    ]
  },
  {
    "version": "1.4.0-pre",
    "title": "",
    "description": [
      "【新增】貓之城1.4版本前的角色技能",
    ]
  },
  {
    "version": "",
    "title": "Before 1.4.0",
    "description": [
      "【其他】在此之前未受版本紀錄",
    ]
  },
]

const catCityVersionList = [
  {
    "version": "1.16",
    "title": "遠山來賀"
  },
  {
    "version": "1.15",
    "title": "一周年慶典"
  },
  {
    "version": "1.14",
    "title": "悼亡之影"
  },
  {
    "version": "1.13",
    "title": "無名之花"
  },
  {
    "version": "1.12",
    "title": "相聞歌"
  },
  {
    "version": "1.11",
    "title": "貓與夢王國"
  },
  {
    "version": "1.10",
    "title": "夏日狂歡節"
  },
  {
    "version": "1.9",
    "title": "半周年慶典"
  },
  {
    "version": "1.8",
    "title": "百味蛋糕店"
  },
  {
    "version": "1.7",
    "title": "深淵的迴響"
  },
  {
    "version": "1.6",
    "title": "竹野熊蹤"
  },
  {
    "version": "1.5",
    "title": "夢境奇緣"
  },
  {
    "version": "1.4",
    "title": "龍貓相遇，雲瑞成雙"
  },
  {
    "version": "1.3",
    "title": "無法逃離的世界"
  },
  {
    "version": "1.2",
    "title": "消融冰雪之心"
  },
  {
    "version": "1.1",
    "title": "暖雪來信"
  },
]

export default {
  bookVersionList,
  catCityVersionList
}
